app/Controllers/Admin/Dashboard.php

SELECT *
FROM `type_formation`
---
    function index(): string
{
        $typeFormationModel = new \App\Models\TypeFormationModel();
        $data = [
            'nom'              => session()->get('nom'),
            'prenom'           => session()->get('prenom'),
            'email'            => session()->get('email'),
            'types_formation'  => $typeFormationModel->findAll(),