app/Controllers/Admin/Formation.php

    function index() {
        $formationModel     = new FormationModel();
        $typeFormationModel = new TypeFormationModel();

        $formations = $formationModel->getAllWithTypes();
        $types      = $typeFormationModel->findAll();
---
SELECT *
FROM `type_formation`

    function getDeleted() {
        $formationModel = new FormationModel();
        $formations = $formationModel->onlyDeleted()->findAll();
---
SELECT *
FROM `formation`
WHERE `formation`.`deleted_at` IS NOT NULL