app/Controllers/Admin/Session.php

SELECT *
FROM `formateur`
WHERE `formateur`.`deleted_at` IS NULL
SELECT *
FROM `modalite`
---
    function index(int $id_formation) :string {
        $sessionModel   = new SessionModel();
        $formateurModel = new FormateurModel();
        $modaliteModel  = new ModaliteModel();

        $sessions   = $sessionModel->getSessionsWithDetails($id_formation);
        $formateurs = $formateurModel->findAll();
        $modalites  = $modaliteModel->findAll();