app/Controllers/Admin/Student.php

SELECT *
FROM `eleve`
WHERE `eleve`.`deleted_at` IS NULL
---
    function index() {
        $eleveModel = new EleveModel();
        $students = $eleveModel->findAll();