app/Controllers/Admin/Teacher.php

SELECT *
FROM `formateur`
---
    function index() {
        $formateurModel = new FormateurModel();
        $teachers = $formateurModel->findAll();