app/Models/FormationModel.php

SELECT `formation`.*, GROUP_CONCAT(type_formation.libelle SEPARATOR ", ") AS types
FROM `formation`
LEFT JOIN `Typer` ON `Typer`.`id_formation` = `formation`.`id_formation`
LEFT JOIN `type_formation` ON `type_formation`.`id_type_formation` = `Typer`.`id_type_formation`
WHERE `formation`.`deleted_at` IS NULL
GROUP BY `formation`.`id_formation`
---
    public function getAllWithTypes() : array {
        return $this
            ->select('formation.*, GROUP_CONCAT(type_formation.libelle SEPARATOR ", ") AS types')
            ->join('Typer', 'Typer.id_formation = formation.id_formation', 'left')
            ->join('type_formation', 'type_formation.id_type_formation = Typer.id_type_formation', 'left')
            ->groupBy('formation.id_formation')
            ->findAll();

SELECT `formation`.*, `type_formation`.`libelle` AS `type_libelle`
FROM `formation`
LEFT JOIN `Typer` ON `Typer`.`id_formation` = `formation`.`id_formation`
LEFT JOIN `type_formation` ON `type_formation`.`id_type_formation` = `Typer`.`id_type_formation`
WHERE `formation`.`deleted_at` IS NULL
AND  `formation`.`titre` LIKE '%Java%' ESCAPE '!'
---
    public function search(array $filtres) : array {
        $builder = $this->db->table('formation');
        $builder->join('Typer', 'Typer.id_formation = formation.id_formation', 'left')
                ->join('type_formation', 'type_formation.id_type_formation = Typer.id_type_formation', 'left')
                ->select('formation.*, type_formation.libelle AS type_libelle')
                ->where('formation.deleted_at', null);

        if (!empty($filtres['titre'])) {
            $builder->like('formation.titre', $filtres['titre']);
        }
        if (!empty($filtres['langue'])) {
            $builder->where('formation.langue', $filtres['langue']);
        }
        if (!empty($filtres['prix_max'])) {
            $builder->where('formation.prix <=', $filtres['prix_max']);
        }
        if (!empty($filtres['duree'])) {
            $builder->where('formation.duree', $filtres['duree']);
        }
        if (!empty($filtres['id_type_formation'])) {
            $builder->whereIn('Typer.id_type_formation', $filtres['id_type_formation']);
        }

        return $builder->get()->getResultArray();