app/Models/RememberTokenModel.php

SELECT *
FROM `remember_tokens`
WHERE `token` = '49c29b0a1047612f66e6565853abaa32a51a3555390d1b9035721c1e25a0caa5'
AND `expires_at` > '2026-06-09 09:57:38'
 LIMIT 1
---
    public function findValidToken(string $token): ?array
    {
        return $this
            ->where('token', $token)
            ->where('expires_at >', date('Y-m-d H:i:s'))
            ->first();