app/Models/SessionModel.php

    public function countInscrits(int $id_session): int {
        return $this->db->table('S_inscrire')
            ->where('id_session', $id_session)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `S_inscrire`
WHERE `id_session` = 1